tutorial/channel-simpleFoam/Allrun
#!/usr/bin/env bash
set -euo pipefail
cd "$(dirname "$0")"
blockMesh
simpleFoam
echo "concluido (simplefoam laminar)."
